

@CLASS
d2s

@auto[]
$ws[
		$.0[]
		$.1[один]
		$.2[два]
		$.3[три]
		$.4[четыре]
		$.5[п€ть]
		$.6[шесть]
		$.7[семь]
		$.8[восемь]
		$.9[дев€ть]
		$.10[дес€ть]

		$.11[одиннадцать]
		$.12[двенадцать]
		$.13[тринадцать]
		$.14[четырнадцать]
		$.15[п€тнадцать]
		$.16[шестнадцать]
		$.17[семнадцать]
		$.18[восемнадцать]
		$.19[дев€тнадцать]
	$.20[	
		$.2[двадцать]
		$.3[тридцать]
		$.4[сорок]
		$.5[п€тьдес€т]
		$.6[шестьдес€т]
		$.7[семьдес€т]
		$.8[восемьдес€т]
		$.9[дев€носто]
	]
	$.100[	
		$.1[сто]
		$.2[двести]
		$.3[триста]
		$.4[четыреста]
		$.5[п€тьсот]
		$.6[шестьсот]
		$.7[семьсот]
		$.8[восемьсот]
		$.9[дев€тьсот]
	]
	$.f[
		$.1[одна тыс€ча]
		$.2[две тыс€чи]
		$.3[три тыс€чи]
		$.4[четыре тыс€чи]
		$.5[тыс€ч]
	]	
]

@ru[d;m]

$y[^str2[$d;$m]]
$y[^y.match[\n|	][ig]{ }]
$y[^y.match[ +][ig]{ }]
$result[$y]

@str2[d;m][dec]
$d[^d.format[%.2f]]
$d[^d.split[.;lh]]
^str3[$d.0]^if(def $m){ руб. $dec[${d.1}00]^dec.left(2) коп.}

@str3[d]
#1000-999999
^if(^d.length[] > 3){
^str4[^d.left(^d.length[] - 3);f]
}
#0-999
$a[^d.right(3)]
^str4[$a]

@str4[d;f]
^if(^d.length[] == 3){
	$ws.100.[^d.left(1)] 
}
$d[^d.right(2)]
^if($d > 19){
	$ws.20.[^d.left(1)]
	$d[^d.right(1)]
}
$d(^d.int[])$d[$d]
^if(def $f){
	^if($d > 1 && $d < 5){
		$ws.f.$d
	}{
		^if($d == 1){$ws.f.1}{$ws.$d $ws.f.5}
	}
}{
	$ws.$d 
}